Config = {}
Config.Enable = {}
Config.Timer = {}

---------------------------------------------------------------
Config.Locale = 'en'
Config.CheckVersion = false
Config.CheckVersionDelay = 60 -- Minutes

-- use phone_number instead of player name for 911 calls
Config.PhoneNumber = true

-- use mdt notifications for 911 calls instead of WF_Alerts
Config.Default911 = true

-- enable alerts when cops break the law and print to console
Config.Debug = false

-- sets report chance to 100%
Config.DebugChance = false

-- enable default alerts
Config.Enable.Speeding = true
Config.Enable.Shooting = true
Config.Enable.Autotheft = true
Config.Enable.Melee = false
Config.Enable.PlayerDowned = true
---------------------------------------------------------------

Citizen.CreateThread(function()
    if not GetPlayerPed(-1) then return end
    while not firstname do
        Citizen.Wait(10)
    end

    if notLoaded then
        for k, v in pairs(Config.Enable) do
            if Config.Enable[k] ~= false then
                Config[k] = {}
                Config.Timer[k] = 0 -- Default to 0 seconds
                Config[k].Success = 30 -- Default to 30 seconds
                Config[k].Fail = 2 -- Default to 2 seconds
            end
        end
        -- If you want to set specific timers, do it here
        if Config.Shooting then
            Config.Shooting.Success = 10 -- 10 seconds
            Config.Shooting.Fail = 0 -- 0 seconds
        end
            
        notLoaded = nil
    end

    Config.WeaponBlacklist = {
        'WEAPON_MUSKET'
    }

    Config.Colours = {
        ['0'] = "金屬黑",
        ['1'] = "金屬石墨黑",
        ['2'] = "金屬黑鋼",
        ['3'] = "金屬深銀",
        ['4'] = "金屬銀",
        ['5'] = "金屬藍銀",
        ['6'] = "金屬灰色",
        ['7'] = "金屬陰影銀",
        ['8'] = "金屬石銀",
        ['9'] = "金屬午夜銀幣",
        ['10'] = "金屬槍金屬",
        ['11'] = "金屬無菸煤灰色",
        ['12'] = "啞光黑",
        ['13'] = "啞光灰色",
        ['14'] = "啞光灰色",
        ['15'] = "實用黑色",
        ['16'] = "實用黑色多邊形",
        ['17'] = "實用黑銀",
        ['18'] = "實用銀牌",
        ['19'] = "實用金屬",
        ['20'] = "實用銀影",
        ['21'] = "破舊的黑色",
        ['22'] = "破舊的石墨",
        ['23'] = "破舊的銀灰色",
        ['24'] = "破舊的銀",
        ['25'] = "破舊的藍色銀色",
        ['26'] = "破舊的影子銀",
        ['27'] = "金屬紅",
        ['28'] = "金屬都靈紅",
        ['29'] = "金屬配方紅",
        ['30'] = "金屬火焰紅",
        ['31'] = "金屬優美的紅色",
        ['32'] = "金屬石榴石紅",
        ['33'] = "金屬沙漠紅",
        ['34'] = "金屬赤霞珠",
        ['35'] = "金屬糖果紅",
        ['36'] = "金屬日出橙",
        ['37'] = "金屬經典金",
        ['38'] = "金屬橙",
        ['39'] = "啞光紅",
        ['40'] = "啞光暗紅色",
        ['41'] = "啞橙色",
        ['42'] = "啞光黃",
        ['43'] = "實用紅色",
        ['44'] = "實用鮮紅色",
        ['45'] = "烏石榴石紅",
        ['46'] = "破舊的紅色",
        ['47'] = "破舊的金紅色",
        ['48'] = "破舊的深紅色",
        ['49'] = "金屬深綠色",
        ['50'] = "金屬賽車綠色",
        ['51'] = "金屬海綠色",
        ['52'] = "金屬橄欖綠",
        ['53'] = "金屬綠",
        ['54'] = "金屬汽油藍綠色",
        ['55'] = "啞光檸檬綠",
        ['56'] = "利用深綠色",
        ['57'] = "實用綠色",
        ['58'] = "破舊的深綠色",
        ['59'] = "破舊的綠色",
        ['60'] = "破舊的海水沖刷",
        ['61'] = "金屬午夜藍",
        ['62'] = "金屬深藍",
        ['63'] = "金屬薩克森藍",
        ['64'] = "金屬藍",
        ['65'] = "金屬水手藍",
        ['66'] = "金屬港藍",
        ['67'] = "金屬鑽石藍",
        ['68'] = "金屬衝浪藍",
        ['69'] = "金屬航海藍",
        ['70'] = "金屬亮藍",
        ['71'] = "金屬紫藍色",
        ['72'] = "金屬大三角帆",
        ['73'] = "金屬超藍",
        ['74'] = "金屬亮藍",
        ['75'] = " Util Dark Blue",
        ['76'] = "實用午夜藍",
        ['77'] = "實用藍色",
        ['78'] = "藍色海泡綿",
        ['79'] = " Uil Lightning blue",
        ['80'] = "實用毛伊島藍色多邊形",
        ['81'] = "實用明亮的藍色",
        ['82'] = "啞光深藍色",
        ['83'] = "啞光藍",
        ['84'] = "啞光午夜藍",
        ['85'] = "破舊的深藍色",
        ['86'] = "破舊的藍色",
        ['87'] = "破舊的淺藍色",
        ['88'] = "金屬出租車黃色",
        ['89'] = "金屬種族黃色",
        ['90'] = "金屬青銅",
        ['91'] = "金屬黃鳥",
        ['92'] = "金屬石灰",
        ['93'] = "金屬香檳",
        ['94'] = "金屬鎮色米色",
        ['95'] = "金屬深色象牙",
        ['96'] = "金屬巧克力布朗",
        ['97'] = "金屬金棕色",
        ['98'] = "金屬淺棕色",
        ['99'] = "金屬稻草色",
        ['100'] = "金屬苔棕色",
        ['101'] = "金屬比斯頓·布朗",
        ['102'] = "金屬比奇伍德",
        ['103'] = "金屬深色櫸木",
        ['104'] = "金屬巧克力橙",
        ['105'] = "金屬沙灘沙",
        ['106'] = "金屬陽光漂白的沙子",
        ['107'] = "金屬奶油",
        ['108'] = "實用棕色",
        ['109'] = "實用中棕色",
        ['110'] = "實用淺棕色",
        ['111'] = "金屬白",
        ['112'] = "金屬霜白",
        ['113'] = "破舊的米色",
        ['114'] = "破舊的棕色",
        ['115'] = "破舊的深棕色",
        ['116'] = "破舊的米色稻草",
        ['117'] = "拉絲鋼",
        ['118'] = "黑色磨砂鋼",
        ['119'] = "拉絲鋁",
        ['120'] = " 鋁合金",
        ['121'] = "破舊的白色",
        ['122'] = "白底使用",
        ['123'] = "破舊的橙色",
        ['124'] = "破舊的淺橙色",
        ['125'] = "金屬安全劑綠色",
        ['126'] = "破舊的出租車黃燈",
        ['127'] = "警車藍",
        ['128'] = "啞光綠色",
        ['129'] = "啞光布朗",
        ['130'] = "破舊的橙色",
        ['131'] = "啞光白",
        ['132'] = "破舊的白色",
        ['133'] = "破舊的橄欖綠色軍綠色",
        ['134'] = "純白色",
        ['135'] = "流行粉紅",
        ['136'] = "鮭魚粉",
        ['137'] = "金屬朱紅色粉",
        ['138'] = "橙色",
        ['139'] = "綠色",
        ['140'] = "藍色",
        ['141'] = "馬賽克黑藍色",
        ['142'] = "金屬黑紫色",
        ['143'] = "金屬黑紅色",
        ['144'] = "綠色的獵人",
        ['145'] = "金屬紫",
        ['146'] = "金屬深藍",
        ['147'] = "黑色",
        ['148'] = "啞光紫色",
        ['149'] = "啞光暗紫色",
        ['150'] = "金屬熔岩紅",
        ['151'] = "啞光森林綠色",
        ['152'] = "啞光橄欖色阿拉伯",
        ['153'] = "啞光沙漠棕",
        ['154'] = "啞光棕褐色",
        ['155'] = "啞光綠色",
        ['156'] = "默認合金顏色",
        ['157'] = "Epsilon Blue",
        ['158'] = "純金",
        ['159'] = "拉絲金",
        ['160'] = "MP100"
    }

end)
